УНФ_ТЕСТ/src/Catalogs/КП_ШаблоныОбработкиЗадач/КП_ШаблоныОбработкиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КП_ШаблоныОбработкиЗадач</name>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>CatalogRef.КП_ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнениеПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатБулево</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатФайл</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатЛичнаяВстреча</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатТелефонныйЗвонок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторШаблона</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаКБП</name>
    <type>
      <types>CatalogRef.КП_ТочкиПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетИсполнителя</name>
    <type>
      <types>CatalogRef.КП_ТребуемыеРезультатыИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/КП_ШаблоныОбработкиЗадач/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Список.РежимВыбора=ЭтаФорма.Параметры.РежимВыбора;

	Если Элементы.Список.РежимВыбора Тогда
		РежимОткрытияОкна=РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
	
	ТекущийПользователь=Пользователи.ТекущийПользователь();
	
	Если Параметры.Свойство("Отбор") Тогда
		Параметры.Отбор.Свойство("ВидПроцесса", ВидПроцесса);
		Параметры.Отбор.Свойство("ТочкаКБП", ТочкаКБП);
		Параметры.Отбор.Свойство("АвторШаблона", АвторШаблона);
		Параметры.Отбор.Свойство("ОтчетИсполнителя", ОтчетИсполнителя);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидПроцессаПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("ВидПроцесса", ?(ЗначениеЗаполнено(ВидПроцесса), ВидПроцесса, NULL));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОткрыватьСписокШаблоновВыполненияЗадачБезОтбораЗначение=КП_ОбщееСервер.ЗагрузитьНастройкуПользователя("НастройкиПользователя", "ОткрыватьСписокШаблоновВыполненияЗадачБезОтбора", , СокрЛП(ТекущийПользователь));
	Если ОткрыватьСписокШаблоновВыполненияЗадачБезОтбораЗначение=Неопределено Тогда
		ОткрыватьСписокШаблоновВыполненияЗадачБезОтбора=Ложь;
		
	Иначе
		ОткрыватьСписокШаблоновВыполненияЗадачБезОтбора=ОткрыватьСписокШаблоновВыполненияЗадачБезОтбораЗначение;
		
	КонецЕсли;

	Если ОткрыватьСписокШаблоновВыполненияЗадачБезОтбора Тогда
		ВидПроцесса=NULL;
		ТочкаКБП=NULL;
		АвторШаблона=NULL;
		ОтчетИсполнителя=NULL;
		
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ВидПроцесса", ?(ЗначениеЗаполнено(ВидПроцесса), ВидПроцесса, NULL));
	Список.Параметры.УстановитьЗначениеПараметра("ТочкаКБП", ?(ЗначениеЗаполнено(ТочкаКБП), ТочкаКБП, NULL));
    Список.Параметры.УстановитьЗначениеПараметра("АвторШаблона", ?(ЗначениеЗаполнено(АвторШаблона), АвторШаблона, NULL));
	Список.Параметры.УстановитьЗначениеПараметра("ОтчетИсполнителя", ?(ЗначениеЗаполнено(ОтчетИсполнителя), ОтчетИсполнителя, NULL));
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ТочкаКБППриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ТочкаКБП", ?(ЗначениеЗаполнено(ТочкаКБП), ТочкаКБП, NULL));
	
КонецПроцедуры

&НаКлиенте
Процедура АвторШаблонаПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("АвторШаблона", ?(ЗначениеЗаполнено(АвторШаблона), АвторШаблона, NULL));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетИсполнителяПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ОтчетИсполнителя", ?(ЗначениеЗаполнено(ОтчетИсполнителя), ОтчетИсполнителя, NULL));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ=Истина;
	ПараметрыФормы=Новый Структура;
	
	ПараметрыЗаполнения=Новый Структура;
	ПараметрыЗаполнения.Вставить("ВидПроцесса", ВидПроцесса);
	ПараметрыЗаполнения.Вставить("ОтчетИсполнителя", ОтчетИсполнителя);
	
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыЗаполнения);
	
	ОткрытьФорму("Справочник.КП_ШаблоныОбработкиЗадач.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
